app/Controllers/Mapa.php

    public function buscar()
    {
        $busqueda = $this->request->getGet('q');

        if (empty($busqueda)) {
            return $this->response->setJSON(['status' => 'error', 'message' => 'Término de búsqueda vacío']);
        }

        $libroModel = new LibroModel();

        // Buscar el libro por título o autor (búsqueda flexible)
        $libros = $libroModel->select('libros.titulo, libros.autor, ubicaciones.codigo_librero, ubicaciones.fila')
                             ->join('ubicaciones', 'ubicaciones.id_ubicacion = libros.id_ubicacion')
                             ->groupStart()
                                ->like('libros.titulo', $busqueda)
                                ->orLike('libros.autor', $busqueda)
                             ->groupEnd()
                             ->findAll(10); // Límite de 10 resultados para no saturar
---
SELECT `libros`.`titulo`, `libros`.`autor`, `ubicaciones`.`codigo_librero`, `ubicaciones`.`fila`
FROM `libros`
JOIN `ubicaciones` ON `ubicaciones`.`id_ubicacion` = `libros`.`id_ubicacion`
WHERE   (
`libros`.`titulo` LIKE '%BIO%' ESCAPE '!'
OR  `libros`.`autor` LIKE '%BIO%' ESCAPE '!'
 )
 LIMIT 10