app/Models/FichaMovimientoModel.php

    public function registrarFichaCompleta(array $datosPost): bool
    {
        // Instanciamos los otros modelos necesarios
        $lectorModel   = new LectorModel();
        $libroModel    = new LibroModel();
        $tematicaModel = new TematicaSugeridaModel();

        // Iniciamos la transacción
        $this->db->transStart();

        // --- A. GUARDAR EL LECTOR ---
        $datosLector = [
            'nombre_completo'   => $datosPost['nombre_lector'],
            'telefono'          => $datosPost['telefono'],
            'pais'              => $datosPost['pais'],
            'estado'            => $datosPost['estado'],
            'ocupacion'         => $datosPost['ocupacion'] ?? null,
            'institucion'       => $datosPost['institucion'] ?? null,
            'acepta_privacidad' => isset($datosPost['privacidad']) ? 1 : 0
        ];
        $lectorModel->insert($datosLector);
        $id_lector = $lectorModel->getInsertID();

        // --- B. VERIFICAR/GUARDAR EL LIBRO ---
       // 1. Ahora leemos el nuevo campo 'folio_adquisicion' que viene del formulario
   $folio = trim($datosPost['folio_adquisicion']);
        $libroExistente = $libroModel->where('folio_adquisicion', $folio)->first();
---
SELECT *
FROM `libros`
WHERE `folio_adquisicion` = '000014'
 LIMIT 1

                'estado_fisico'      => 'en_mesa',
                'datos_completos'    => 0
            ];
            $libroModel->insert($datosLibro);
---
INSERT INTO `libros` (`folio_adquisicion`, `clasificacion_lomo`, `titulo`, `autor`, `volumen`, `anio_publicacion`, `estado_fisico`, `datos_completos`) VALUES ('000014', '234.2.3n2.S2004', 'ejemplo de nueva edicion', 'AUTOR', '2', '1994', 'en_mesa', 0)

    public function procesarFichaAdmin(array $datosPost): bool
    {
        $this->db->transStart();

        $id_ficha           = $datosPost['id_ficha'];
        $tematicasAprobadas = $datosPost['tematicas_aprobadas'] ?? '';

        // 1. Obtener a qué libro pertenece esta ficha para saber qué ID actualizar
        $ficha = $this->find($id_ficha);
        if (!$ficha) {
            return false;
        }
        $id_libro = $ficha['id_libro'];

        // CORRECCIÓN 1: Convertir la Fila y el Librero elegidos por el admin en un id_ubicacion real
        $id_ubicacion = $this->obtenerOcrearUbicacion($datosPost['fila_ubicacion'], $datosPost['numero_librero']);

        // 2. Limpiar y preparar todos los datos corregidos por el Administrador
        $folio_corregido         = trim($datosPost['folio_adquisicion']);
        $titulo_corregido        = trim($datosPost['titulo_libro']);
        $autor_corregido         = trim($datosPost['autor_libro']);
        $volumen_corregido       = trim($datosPost['volumen_libro']);
        $clasificacion_corregida = trim($datosPost['clasificacion_lomo']);

        // Actualizar la tabla de libros
        $this->db->table('libros')->where('id_libro', $id_libro)->update([
            'folio_adquisicion'  => $folio_corregido,         // Guarda el folio validado de 6 dígitos
            'clasificacion_lomo' => $clasificacion_corregida, // <-- CORRECCIÓN 2: ¡AQUÍ YA SE GUARDA EL LOMO!
            'titulo'             => $titulo_corregido,
            'autor'              => $autor_corregido,
            'volumen'            => $volumen_corregido,
            'id_ubicacion'       => $id_ubicacion,            // El ID que generamos en el paso anterior
            'estado_fisico'      => 'en_estante',             // El libro vuelve a estar disponible para su consulta
            'datos_completos'    => 1                         // Marcamos que ya fue auditado por el personal
        ]);
---
UPDATE `libros` SET `folio_adquisicion` = '000015', `clasificacion_lomo` = '234.2.3n2.S20045', `titulo` = 'ejemplo de nueva edicion', `autor` = 'AUTOR', `volumen` = '2', `id_ubicacion` = 167, `estado_fisico` = 'en_estante', `datos_completos` = 1
WHERE `id_libro` = '31'


        // 4. Procesar las Temáticas corregidas (Moderación de etiquetas)
        // Eliminamos las sugerencias preliminares para evitar duplicados o basura en la BD
        $this->db->table('tematicas_sugeridas')->where('id_ficha', $id_ficha)->delete();
---
DELETE FROM `tematicas_sugeridas`
WHERE `id_ficha` = '37'


            // Si el administrador dejó etiquetas válidas, las insertamos en lote
            if (count($datosTematicas) > 0) {
                $this->db->table('tematicas_sugeridas')->insertBatch($datosTematicas);
---
INSERT INTO `tematicas_sugeridas` (`estado_moderacion`, `etiqueta`, `id_ficha`, `id_libro`)
VALUES ('aprobada','botánica','37','31'), ('aprobada','historia','37','31')

    private function obtenerOcrearUbicacion(string $fila, string $librero): int
    {
        $builder = $this->db->table('ubicaciones');

        // ¡Nombres exactos de tu base de datos!
        $columna_fila    = 'fila';
        $columna_librero = 'codigo_librero'; // <--- ESTA ERA LA CAUSA DEL ERROR

        // Realizamos la consulta
        $consulta = $builder->where([
            $columna_fila    => trim($fila),
            $columna_librero => trim($librero)
        ])->get();
---
SELECT *
FROM `ubicaciones`
WHERE `fila` = 'Q'
AND `codigo_librero` = '7'